content-org/all-posts.org
#+hugo_base_dir: ../
#+hugo_section: ./posts
#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+title: Forensic Wheels
#+seq_todo: DRAFT TODO DONE
#+FILETAGS: :forensicwheels:
#+TAGS: @personal @forensic @zen @threathunting
#+TAGS: openbsd honeypot zen personal canarytokens skateboarding visibility

#+startup: indent
#+author: Dirk

* DONE How to monitor systems with monit                                                  :openbsd:personal:visibility:
CLOSED: [2025-12-08 Mo 11:40]
:PROPERTIES:
:EXPORT_AUTHOR: Dirk
:EXPORT_HUGO_FRONT_MATTER_FORMAT: yaml
:HUGO_TITLE: monitoring with monit
:HUGO_MENU_TITLE: monitmon
:HUGO_CHAPTER: true
:HUGO_WEIGHT: 5
:EXPORT_FILE_NAME: monitmon
:EXPORT_DATE: 2025-12-08T11:36:00-05:00
:CUSTOM_ID: monitmon
:END:
** Introduction                                                                          
** Requirements                                                                          
** Installing Monit on OpenBSD                                                           
** Monit – Essential System and Router Services

System monitoring runs every **45 seconds**. The first check is delayed
by **120 seconds** to avoid overloading the system immediately after boot.

#+begin_src conf
set daemon 45
 with start delay 120
#+end_src

Monit logs to **syslog**. `idfile` and `statefile` store Monit's
persistent state and identity across restarts.

#+begin_src conf
set log syslog
set idfile /var/monit/id
set statefile /var/monit/state
#+end_src

Limits control **buffer sizes** and **timeouts** for
program outputs, network I/O, and service start/stop/restart
operations. This prevents Monit from hanging or processing excessive data.

#+begin_src conf
set limits {
     programOutput:     512 B,
     sendExpectBuffer:  256 B,
     fileContentBuffer: 512 B,
     httpContentBuffer: 1 MB,
     networkTimeout:    5 seconds
     programTimeout:    300 seconds
     stopTimeout:       30 seconds
     startTimeout:      30 seconds
     restartTimeout:    30 seconds
}
#+end_src

Monit will send alerts via **local email**. Events are queued under `/var/monit/events` to prevent message loss during temporary network problems.

#+begin_src conf
set mailserver localhost
set eventqueue
 basedir /var/monit/events
 slots 200
set mail-format { from: root@monit }
set alert root@localhost not on { instance, action }
#+end_src

Simply comment out or delete all `set alert` entries:

#+begin_src conf
# set alert root@localhost not on { instance, action }
#+end_src

After this, Monit will **not send any emails**, but it will still monitor services.

----

Monit HTTP interface is on port **2812**. Access is restricted to **localhost**,
a local subnet (`192.168.X.0/24`), and an admin user with a password.

#+begin_src conf
set httpd port 2812 and
    allow localhost
    allow 192.168.X.0/255.255.255.0
    allow admin:foobar
#+end_src

Monit will **start all monitored services**
automatically on reboot.

#+begin_src conf
set onreboot start
#+end_src

This monitors **overall system health**:

- 1- and 5-minute load per CPU core  
- CPU usage  
- Memory and swap usage  

If thresholds are exceeded, it triggers `pushover.sh` for alerts.

#+begin_src conf
check system $HOST
 if loadavg (1min) per core > 2 for 5 cycles then exec /usr/local/bin/pushover.sh
 if loadavg (5min) per core > 1.5 for 10 cycles then exec /usr/local/bin/pushover.sh
 if cpu usage > 95% for 10 cycles then exec /usr/local/bin/pushover.sh
 if memory usage > 75% then exec /usr/local/bin/pushover.sh
 if swap usage > 25% then exec /usr/local/bin/pushover.sh
 group system
#+end_src

`/home` filesystem is monitored for:

- Disk space and inode usage  
- Read/write throughput (MB/s and IOPS)  
- Service response time  

Alerts are sent via `pushover.sh` if any threshold is exceeded.

#+begin_src conf
check filesystem home_fs with path /dev/sd0k
 start program = "/sbin/mount /home"
 stop program  = "/sbin/umount /home"
 if space usage > 90% then exec /usr/local/bin/pushover.sh
 if inode usage > 95% then exec /usr/local/bin/pushover.sh
 if read rate > 8 MB/s for 20 cycles then exec /usr/local/bin/pushover.sh
 if read rate > 800 operations/s for 15 cycles then exec /usr/local/bin/pushover.sh
 if write rate > 8 MB/s for 20 cycles then exec /usr/local/bin/pushover.sh
 if write rate > 800 operations/s for 15 cycles then exec /usr/local/bin/pushover.sh
 if service time > 10 milliseconds for 3 times within 15 cycles then exec /usr/local/bin/pushover.sh
 group system
#+end_src

Root filesystem `/` has similar checks but shorter cycles since it's critical to system stability.
#+begin_src conf
check filesystem root_fs with path /dev/sd0a
 start program = "/sbin/mount /"
 stop program  = "/sbin/umount /"
 if space usage > 90% then exec /usr/local/bin/pushover.sh
 if inode usage > 95% then exec /usr/local/bin/pushover.sh
 if read rate > 8 MB/s for 5 cycles then exec /usr/local/bin/pushover.sh
 if read rate > 800 operations/s for 5 cycles then exec /usr/local/bin/pushover.sh
 if write rate > 8 MB/s for 5 cycles then exec /usr/local/bin/pushover.sh
 if write rate > 800 operations/s for 5 cycles then exec /usr/local/bin/pushover.sh
 if service time > 10 milliseconds for 3 times within 5 cycles then exec /usr/local/bin/pushover.sh
 group system
#+end_src


Monit ensures **secure permissions** for `/root`. If permissions are wrong, monitoring for this directory is disabled to avoid false alarms.

#+begin_src conf
check directory bin with path /root
 if failed permission 700 then unmonitor
 if failed uid 0 then unmonitor
 if failed gid 0 then unmonitor
 group system
#+end_src

A **network host** is ping-checked. Frequent failures trigger alerts. Dependencies on
interfaces and services ensure checks only run when the network is up.

#+begin_src conf
check host homeassistant with address 192.168.X.19
 if failed ping then alert
 if 5 restarts within 10 cycles then exec /usr/local/bin/pushover.sh
 group network
 depends on iface_in,dhcpd,unbound
#+end_src

Monit watches **network interface** `pppoeX`:

- Restarts interface if link goes down  
- Alerts on saturation or high upload  
- Limits repeated restarts to avoid loops


#+begin_src conf
check network iface_out with interface pppoeX
 start program = "/bin/sh /etc/netstart pppoeX"
 if link down then restart else exec /usr/local/bin/pushover.sh
 if changed link then exec /usr/local/bin/pushover.sh
 if saturation > 90% then exec /usr/local/bin/pushover.sh
 if total uploaded > 5 GB in last hour then exec /usr/local/bin/pushover.sh
 if 5 restarts within 10 cycles then exec /usr/local/bin/pushover.sh
 group network
#+end_src

**DNS resolver** `unbound` is monitored by PID and port. Failures trigger a restart, repeated failures trigger alerts.
#+begin_src conf
check process unbound with pidfile /var/unbound/unbound.pid
 start program = "/usr/sbin/rcctl start unbound"
 stop program  = "/usr/sbin/rcctl stop unbound"
 if failed port 53 for 3 cycles then restart
 if 3 restarts within 10 cycles then exec /usr/local/bin/pushover.sh
 group network
 depends on dnscrypt_proxy,iface_out,iface_in
#+end_src

**DHCP server** is monitored. Missing process triggers a restart. Alerts are sent if failures happen repeatedly.

#+begin_src conf
check process dhcpd with matching /usr/sbin/dhcpd
 start program = "/usr/sbin/rcctl start dhcpd"
 stop program  = "/usr/sbin/rcctl stop dhcpd"
 if does not exist then restart
 if 2 restarts within 10 cycles then exec /usr/local/bin/pushover.sh
 group network
 depends on iface_in
#+end_src

**NTP daemon** ensures time synchronization. Missing process triggers restart; repeated issues generate alerts.

#+begin_src conf
check process ntpd with matching /usr/sbin/ntpd
 start program = "/usr/sbin/rcctl start ntpd"
 stop program  = "/usr/sbin/rcctl stop ntpd"
 if does not exist then restart
 if 5 restarts within 5 cycles then exec /usr/local/bin/pushover.sh
 group network
 depends on iface_out
#+end_src

**vnStat daemon** monitors network traffic statistics. Monit restarts it if it stops and alerts on repeated failures.

#+begin_src conf
check process vnstatd with matching /usr/local/sbin/vnstatd
 start program = "/usr/sbin/rcctl start vnstatd"
 stop program  = "/usr/sbin/rcctl stop vnstatd"
 if does not exist then restart
 if 5 restarts within 15 cycles then exec /usr/local/bin/pushover.sh
 group network
 depends on iface_out
#+end_src

** Adding Pushover Alerts                                                                
** Testing and Maintenance                                                               
** Conclusion                                                                            
Using Monit together with Pushover is an excellent way to keep a close eye on an OpenBSD router.  
Monit is tiny, fast, and reliable — perfect for embedded hardware.  
Pushover provides instant alerts with almost no configuration or overhead.

For a home router or small business network, this combination gives you
semi professional-grade monitoring with minimal effort.

#+BEGIN_EXPORT md
{{< giscus >}}
#+END_EXPORT

